benchmarking/results/final/20260425_141231_spike-test.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/ikoafian/LEARN/RISET/swift-microservices/benchmarking/k6/scenarios/spike-test.js
        output: json (/Users/ikoafian/LEARN/RISET/swift-microservices/benchmarking/results/final/20260425_141231_spike-test.json)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 6m0s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 5m30s over 6 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/200 VUs, 4 complete and 0 interrupted iterations
default   [   0% ] 001/200 VUs  0m01.0s/5m30.0s

running (0m02.0s), 001/200 VUs, 8 complete and 0 interrupted iterations
default   [   1% ] 001/200 VUs  0m02.0s/5m30.0s

running (0m03.0s), 001/200 VUs, 13 complete and 0 interrupted iterations
default   [   1% ] 001/200 VUs  0m03.0s/5m30.0s

running (0m04.0s), 002/200 VUs, 21 complete and 0 interrupted iterations
default   [   1% ] 002/200 VUs  0m04.0s/5m30.0s

running (0m05.0s), 002/200 VUs, 30 complete and 0 interrupted iterations
default   [   2% ] 002/200 VUs  0m05.0s/5m30.0s

running (0m06.0s), 002/200 VUs, 40 complete and 0 interrupted iterations
default   [   2% ] 002/200 VUs  0m06.0s/5m30.0s

running (0m07.0s), 003/200 VUs, 52 complete and 0 interrupted iterations
default   [   2% ] 003/200 VUs  0m07.0s/5m30.0s

running (0m08.0s), 003/200 VUs, 65 complete and 0 interrupted iterations
default   [   2% ] 003/200 VUs  0m08.0s/5m30.0s

running (0m09.0s), 003/200 VUs, 80 complete and 0 interrupted iterations
default   [   3% ] 003/200 VUs  0m09.0s/5m30.0s

running (0m10.0s), 004/200 VUs, 97 complete and 0 interrupted iterations
default   [   3% ] 004/200 VUs  0m10.0s/5m30.0s

running (0m11.0s), 004/200 VUs, 113 complete and 0 interrupted iterations
default   [   3% ] 004/200 VUs  0m11.0s/5m30.0s

running (0m12.0s), 004/200 VUs, 133 complete and 0 interrupted iterations
default   [   4% ] 004/200 VUs  0m12.0s/5m30.0s

running (0m13.0s), 005/200 VUs, 154 complete and 0 interrupted iterations
default   [   4% ] 005/200 VUs  0m13.0s/5m30.0s

running (0m14.0s), 005/200 VUs, 174 complete and 0 interrupted iterations
default   [   4% ] 005/200 VUs  0m14.0s/5m30.0s

running (0m15.0s), 005/200 VUs, 199 complete and 0 interrupted iterations
default   [   5% ] 005/200 VUs  0m15.0s/5m30.0s

running (0m16.0s), 006/200 VUs, 224 complete and 0 interrupted iterations
default   [   5% ] 006/200 VUs  0m16.0s/5m30.0s

running (0m17.0s), 006/200 VUs, 249 complete and 0 interrupted iterations
default   [   5% ] 006/200 VUs  0m17.0s/5m30.0s

running (0m18.0s), 006/200 VUs, 279 complete and 0 interrupted iterations
default   [   5% ] 006/200 VUs  0m18.0s/5m30.0s

running (0m19.0s), 007/200 VUs, 309 complete and 0 interrupted iterations
default   [   6% ] 007/200 VUs  0m19.0s/5m30.0s

running (0m20.0s), 007/200 VUs, 337 complete and 0 interrupted iterations
default   [   6% ] 007/200 VUs  0m20.0s/5m30.0s

running (0m21.0s), 007/200 VUs, 372 complete and 0 interrupted iterations
default   [   6% ] 007/200 VUs  0m21.0s/5m30.0s

running (0m22.0s), 007/200 VUs, 406 complete and 0 interrupted iterations
default   [   7% ] 007/200 VUs  0m22.0s/5m30.0s

running (0m23.0s), 008/200 VUs, 439 complete and 0 interrupted iterations
default   [   7% ] 008/200 VUs  0m23.0s/5m30.0s

running (0m24.0s), 008/200 VUs, 478 complete and 0 interrupted iterations
default   [   7% ] 008/200 VUs  0m24.0s/5m30.0s

running (0m25.0s), 008/200 VUs, 518 complete and 0 interrupted iterations
default   [   8% ] 008/200 VUs  0m25.0s/5m30.0s

running (0m26.0s), 009/200 VUs, 554 complete and 0 interrupted iterations
default   [   8% ] 009/200 VUs  0m26.0s/5m30.0s

running (0m27.0s), 009/200 VUs, 599 complete and 0 interrupted iterations
default   [   8% ] 009/200 VUs  0m27.0s/5m30.0s

running (0m28.0s), 009/200 VUs, 642 complete and 0 interrupted iterations
default   [   8% ] 009/200 VUs  0m28.0s/5m30.0s

running (0m29.0s), 010/200 VUs, 682 complete and 0 interrupted iterations
default   [   9% ] 010/200 VUs  0m29.0s/5m30.0s

running (0m30.0s), 010/200 VUs, 732 complete and 0 interrupted iterations
default   [   9% ] 010/200 VUs  0m30.0s/5m30.0s

running (0m31.0s), 010/200 VUs, 772 complete and 0 interrupted iterations
default   [   9% ] 010/200 VUs  0m31.0s/5m30.0s

running (0m32.0s), 011/200 VUs, 823 complete and 0 interrupted iterations
default   [  10% ] 011/200 VUs  0m32.0s/5m30.0s

running (0m33.0s), 011/200 VUs, 868 complete and 0 interrupted iterations
default   [  10% ] 011/200 VUs  0m33.0s/5m30.0s

running (0m34.0s), 011/200 VUs, 923 complete and 0 interrupted iterations
default   [  10% ] 011/200 VUs  0m34.0s/5m30.0s

running (0m35.0s), 012/200 VUs, 968 complete and 0 interrupted iterations
default   [  11% ] 012/200 VUs  0m35.0s/5m30.0s

running (0m36.0s), 012/200 VUs, 1027 complete and 0 interrupted iterations
default   [  11% ] 012/200 VUs  0m36.0s/5m30.0s

running (0m37.0s), 012/200 VUs, 1087 complete and 0 interrupted iterations
default   [  11% ] 012/200 VUs  0m37.0s/5m30.0s

running (0m38.0s), 013/200 VUs, 1147 complete and 0 interrupted iterations
default   [  12% ] 013/200 VUs  0m38.0s/5m30.0s

running (0m39.0s), 013/200 VUs, 1201 complete and 0 interrupted iterations
default   [  12% ] 013/200 VUs  0m39.0s/5m30.0s

running (0m40.0s), 013/200 VUs, 1264 complete and 0 interrupted iterations
default   [  12% ] 013/200 VUs  0m40.0s/5m30.0s

running (0m41.0s), 013/200 VUs, 1318 complete and 0 interrupted iterations
default   [  12% ] 013/200 VUs  0m41.0s/5m30.0s

running (0m42.0s), 014/200 VUs, 1387 complete and 0 interrupted iterations
default   [  13% ] 014/200 VUs  0m42.0s/5m30.0s

running (0m43.0s), 014/200 VUs, 1457 complete and 0 interrupted iterations
default   [  13% ] 014/200 VUs  0m43.0s/5m30.0s

running (0m44.0s), 014/200 VUs, 1513 complete and 0 interrupted iterations
default   [  13% ] 014/200 VUs  0m44.0s/5m30.0s

running (0m45.0s), 015/200 VUs, 1586 complete and 0 interrupted iterations
default   [  14% ] 015/200 VUs  0m45.0s/5m30.0s

running (0m46.0s), 015/200 VUs, 1661 complete and 0 interrupted iterations
default   [  14% ] 015/200 VUs  0m46.0s/5m30.0s

running (0m47.0s), 015/200 VUs, 1722 complete and 0 interrupted iterations
default   [  14% ] 015/200 VUs  0m47.0s/5m30.0s

running (0m48.0s), 016/200 VUs, 1798 complete and 0 interrupted iterations
default   [  15% ] 016/200 VUs  0m48.0s/5m30.0s

running (0m49.0s), 016/200 VUs, 1864 complete and 0 interrupted iterations
default   [  15% ] 016/200 VUs  0m49.0s/5m30.0s

running (0m50.0s), 016/200 VUs, 1944 complete and 0 interrupted iterations
default   [  15% ] 016/200 VUs  0m50.0s/5m30.0s

running (0m51.0s), 017/200 VUs, 2026 complete and 0 interrupted iterations
default   [  15% ] 017/200 VUs  0m51.0s/5m30.0s

running (0m52.0s), 017/200 VUs, 2094 complete and 0 interrupted iterations
default   [  16% ] 017/200 VUs  0m52.0s/5m30.0s

running (0m53.0s), 017/200 VUs, 2179 complete and 0 interrupted iterations
default   [  16% ] 017/200 VUs  0m53.0s/5m30.0s

running (0m54.0s), 018/200 VUs, 2248 complete and 0 interrupted iterations
default   [  16% ] 018/200 VUs  0m54.0s/5m30.0s

running (0m55.0s), 018/200 VUs, 2338 complete and 0 interrupted iterations
default   [  17% ] 018/200 VUs  0m55.0s/5m30.0s

running (0m56.0s), 018/200 VUs, 2410 complete and 0 interrupted iterations
default   [  17% ] 018/200 VUs  0m56.0s/5m30.0s

running (0m57.0s), 019/200 VUs, 2500 complete and 0 interrupted iterations
default   [  17% ] 019/200 VUs  0m57.0s/5m30.0s

running (0m58.0s), 019/200 VUs, 2595 complete and 0 interrupted iterations
default   [  18% ] 019/200 VUs  0m58.0s/5m30.0s

running (0m59.0s), 019/200 VUs, 2671 complete and 0 interrupted iterations
default   [  18% ] 019/200 VUs  0m59.0s/5m30.0s

running (1m00.0s), 019/200 VUs, 2766 complete and 0 interrupted iterations
default   [  18% ] 019/200 VUs  1m00.0s/5m30.0s

running (1m01.0s), 025/200 VUs, 2857 complete and 0 interrupted iterations
default   [  18% ] 025/200 VUs  1m01.0s/5m30.0s

running (1m02.0s), 031/200 VUs, 2992 complete and 0 interrupted iterations
default   [  19% ] 031/200 VUs  1m02.0s/5m30.0s

running (1m03.0s), 037/200 VUs, 3160 complete and 0 interrupted iterations
default   [  19% ] 037/200 VUs  1m03.0s/5m30.0s

running (1m04.0s), 043/200 VUs, 3356 complete and 0 interrupted iterations
default   [  19% ] 043/200 VUs  1m04.0s/5m30.0s

running (1m05.0s), 049/200 VUs, 3565 complete and 0 interrupted iterations
default   [  20% ] 049/200 VUs  1m05.0s/5m30.0s

running (1m06.0s), 055/200 VUs, 3816 complete and 0 interrupted iterations
default   [  20% ] 055/200 VUs  1m06.0s/5m30.0s

running (1m07.0s), 061/200 VUs, 4092 complete and 0 interrupted iterations
default   [  20% ] 061/200 VUs  1m07.0s/5m30.0s

running (1m08.0s), 067/200 VUs, 4408 complete and 0 interrupted iterations
default   [  21% ] 067/200 VUs  1m08.0s/5m30.0s

running (1m09.0s), 073/200 VUs, 4755 complete and 0 interrupted iterations
default   [  21% ] 073/200 VUs  1m09.0s/5m30.0s

running (1m10.0s), 079/200 VUs, 5134 complete and 0 interrupted iterations
default   [  21% ] 079/200 VUs  1m10.0s/5m30.0s

running (1m11.0s), 085/200 VUs, 5540 complete and 0 interrupted iterations
default   [  22% ] 085/200 VUs  1m11.0s/5m30.0s

running (1m12.0s), 091/200 VUs, 5950 complete and 0 interrupted iterations
default   [  22% ] 091/200 VUs  1m12.0s/5m30.0s

running (1m13.0s), 097/200 VUs, 6379 complete and 0 interrupted iterations
default   [  22% ] 097/200 VUs  1m13.0s/5m30.0s

running (1m14.0s), 103/200 VUs, 6878 complete and 0 interrupted iterations
default   [  22% ] 103/200 VUs  1m14.0s/5m30.0s

running (1m15.0s), 109/200 VUs, 7371 complete and 0 interrupted iterations
default   [  23% ] 109/200 VUs  1m15.0s/5m30.0s

running (1m16.0s), 115/200 VUs, 7897 complete and 0 interrupted iterations
default   [  23% ] 115/200 VUs  1m16.0s/5m30.0s

running (1m17.0s), 121/200 VUs, 8472 complete and 0 interrupted iterations
default   [  23% ] 121/200 VUs  1m17.0s/5m30.0s

running (1m18.0s), 127/200 VUs, 9088 complete and 0 interrupted iterations
default   [  24% ] 127/200 VUs  1m18.0s/5m30.0s

running (1m19.0s), 133/200 VUs, 9708 complete and 0 interrupted iterations
default   [  24% ] 133/200 VUs  1m19.0s/5m30.0s

running (1m20.0s), 139/200 VUs, 10340 complete and 0 interrupted iterations
default   [  24% ] 139/200 VUs  1m20.0s/5m30.0s

running (1m21.0s), 145/200 VUs, 11034 complete and 0 interrupted iterations
default   [  25% ] 145/200 VUs  1m21.0s/5m30.0s

running (1m22.0s), 151/200 VUs, 11754 complete and 0 interrupted iterations
default   [  25% ] 151/200 VUs  1m22.0s/5m30.0s

running (1m23.0s), 157/200 VUs, 12506 complete and 0 interrupted iterations
default   [  25% ] 157/200 VUs  1m23.0s/5m30.0s

running (1m24.0s), 163/200 VUs, 13252 complete and 0 interrupted iterations
default   [  25% ] 163/200 VUs  1m24.0s/5m30.0s

running (1m25.0s), 169/200 VUs, 14057 complete and 0 interrupted iterations
default   [  26% ] 169/200 VUs  1m25.0s/5m30.0s

running (1m26.0s), 175/200 VUs, 14890 complete and 0 interrupted iterations
default   [  26% ] 175/200 VUs  1m26.0s/5m30.0s

running (1m27.0s), 181/200 VUs, 15764 complete and 0 interrupted iterations
default   [  26% ] 181/200 VUs  1m27.0s/5m30.0s

running (1m28.0s), 187/200 VUs, 16604 complete and 0 interrupted iterations
default   [  27% ] 187/200 VUs  1m28.0s/5m30.0s

running (1m29.0s), 193/200 VUs, 17510 complete and 0 interrupted iterations
default   [  27% ] 193/200 VUs  1m29.0s/5m30.0s

running (1m30.0s), 199/200 VUs, 18466 complete and 0 interrupted iterations
default   [  27% ] 199/200 VUs  1m30.0s/5m30.0s

running (1m31.0s), 200/200 VUs, 19439 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  1m31.0s/5m30.0s

running (1m32.0s), 200/200 VUs, 20407 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  1m32.0s/5m30.0s

running (1m33.0s), 200/200 VUs, 21363 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  1m33.0s/5m30.0s

running (1m34.0s), 200/200 VUs, 22324 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  1m34.0s/5m30.0s

running (1m35.0s), 200/200 VUs, 23303 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  1m35.0s/5m30.0s

running (1m36.0s), 200/200 VUs, 24277 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  1m36.0s/5m30.0s

running (1m37.0s), 200/200 VUs, 25250 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  1m37.0s/5m30.0s

running (1m38.0s), 200/200 VUs, 26198 complete and 0 interrupted iterations
default   [  30% ] 200/200 VUs  1m38.0s/5m30.0s

running (1m39.0s), 200/200 VUs, 27135 complete and 0 interrupted iterations
default   [  30% ] 200/200 VUs  1m39.0s/5m30.0s

running (1m40.0s), 200/200 VUs, 28107 complete and 0 interrupted iterations
default   [  30% ] 200/200 VUs  1m40.0s/5m30.0s

running (1m41.0s), 200/200 VUs, 29102 complete and 0 interrupted iterations
default   [  31% ] 200/200 VUs  1m41.0s/5m30.0s

running (1m42.0s), 200/200 VUs, 30022 complete and 0 interrupted iterations
default   [  31% ] 200/200 VUs  1m42.0s/5m30.0s

running (1m43.0s), 200/200 VUs, 30955 complete and 0 interrupted iterations
default   [  31% ] 200/200 VUs  1m43.0s/5m30.0s

running (1m44.0s), 200/200 VUs, 31920 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  1m44.0s/5m30.0s

running (1m45.0s), 200/200 VUs, 32881 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  1m45.0s/5m30.0s

running (1m46.0s), 200/200 VUs, 33849 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  1m46.0s/5m30.0s

running (1m47.0s), 200/200 VUs, 34849 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  1m47.0s/5m30.0s

running (1m48.0s), 200/200 VUs, 35840 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  1m48.0s/5m30.0s

running (1m49.0s), 200/200 VUs, 36778 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  1m49.0s/5m30.0s

running (1m50.0s), 200/200 VUs, 37727 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  1m50.0s/5m30.0s

running (1m51.0s), 200/200 VUs, 38679 complete and 0 interrupted iterations
default   [  34% ] 200/200 VUs  1m51.0s/5m30.0s

running (1m52.0s), 200/200 VUs, 39649 complete and 0 interrupted iterations
default   [  34% ] 200/200 VUs  1m52.0s/5m30.0s

running (1m53.0s), 200/200 VUs, 40620 complete and 0 interrupted iterations
default   [  34% ] 200/200 VUs  1m53.0s/5m30.0s

running (1m54.0s), 200/200 VUs, 41620 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m54.0s/5m30.0s

running (1m55.0s), 200/200 VUs, 42532 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m55.0s/5m30.0s

running (1m56.0s), 200/200 VUs, 43488 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m56.0s/5m30.0s

running (1m57.0s), 200/200 VUs, 44479 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m57.0s/5m30.0s

running (1m58.0s), 200/200 VUs, 45479 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  1m58.0s/5m30.0s

running (1m59.0s), 200/200 VUs, 46366 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  1m59.0s/5m30.0s

running (2m00.0s), 200/200 VUs, 47304 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  2m00.0s/5m30.0s

running (2m01.0s), 200/200 VUs, 48202 complete and 0 interrupted iterations
default   [  37% ] 200/200 VUs  2m01.0s/5m30.0s

running (2m02.0s), 200/200 VUs, 49149 complete and 0 interrupted iterations
default   [  37% ] 200/200 VUs  2m02.0s/5m30.0s

running (2m03.0s), 200/200 VUs, 50135 complete and 0 interrupted iterations
default   [  37% ] 200/200 VUs  2m03.0s/5m30.0s

running (2m04.0s), 200/200 VUs, 51135 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  2m04.0s/5m30.0s

running (2m05.0s), 200/200 VUs, 52065 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  2m05.0s/5m30.0s

running (2m06.0s), 200/200 VUs, 53065 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  2m06.0s/5m30.0s

running (2m07.0s), 200/200 VUs, 54019 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  2m07.0s/5m30.0s

running (2m08.0s), 200/200 VUs, 54996 complete and 0 interrupted iterations
default   [  39% ] 200/200 VUs  2m08.0s/5m30.0s

running (2m09.0s), 200/200 VUs, 55917 complete and 0 interrupted iterations
default   [  39% ] 200/200 VUs  2m09.0s/5m30.0s

running (2m10.0s), 200/200 VUs, 56889 complete and 0 interrupted iterations
default   [  39% ] 200/200 VUs  2m10.0s/5m30.0s

running (2m11.0s), 200/200 VUs, 57862 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  2m11.0s/5m30.0s

running (2m12.0s), 200/200 VUs, 58841 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  2m12.0s/5m30.0s

running (2m13.0s), 200/200 VUs, 59818 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  2m13.0s/5m30.0s

running (2m14.0s), 200/200 VUs, 60720 complete and 0 interrupted iterations
default   [  41% ] 200/200 VUs  2m14.0s/5m30.0s

running (2m15.0s), 200/200 VUs, 61696 complete and 0 interrupted iterations
default   [  41% ] 200/200 VUs  2m15.0s/5m30.0s

running (2m16.0s), 200/200 VUs, 62696 complete and 0 interrupted iterations
default   [  41% ] 200/200 VUs  2m16.0s/5m30.0s

running (2m17.0s), 200/200 VUs, 63680 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  2m17.0s/5m30.0s

running (2m18.0s), 200/200 VUs, 64615 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  2m18.0s/5m30.0s

running (2m19.0s), 200/200 VUs, 65538 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  2m19.0s/5m30.0s

running (2m20.0s), 200/200 VUs, 66500 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  2m20.0s/5m30.0s

running (2m21.0s), 200/200 VUs, 67500 complete and 0 interrupted iterations
default   [  43% ] 200/200 VUs  2m21.0s/5m30.0s

running (2m22.0s), 200/200 VUs, 68456 complete and 0 interrupted iterations
default   [  43% ] 200/200 VUs  2m22.0s/5m30.0s

running (2m23.0s), 200/200 VUs, 69379 complete and 0 interrupted iterations
default   [  43% ] 200/200 VUs  2m23.0s/5m30.0s

running (2m24.0s), 200/200 VUs, 70342 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  2m24.0s/5m30.0s

running (2m25.0s), 200/200 VUs, 71299 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  2m25.0s/5m30.0s

running (2m26.0s), 200/200 VUs, 72288 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  2m26.0s/5m30.0s

running (2m27.0s), 200/200 VUs, 73277 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  2m27.0s/5m30.0s

running (2m28.0s), 200/200 VUs, 74235 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  2m28.0s/5m30.0s

running (2m29.0s), 200/200 VUs, 75141 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  2m29.0s/5m30.0s

running (2m30.0s), 200/200 VUs, 76047 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  2m30.0s/5m30.0s

running (2m31.0s), 196/200 VUs, 77007 complete and 0 interrupted iterations
default   [  46% ] 196/200 VUs  2m31.0s/5m30.0s

running (2m32.0s), 189/200 VUs, 77952 complete and 0 interrupted iterations
default   [  46% ] 189/200 VUs  2m32.0s/5m30.0s

running (2m33.0s), 183/200 VUs, 78871 complete and 0 interrupted iterations
default   [  46% ] 183/200 VUs  2m33.0s/5m30.0s

running (2m34.0s), 177/200 VUs, 79722 complete and 0 interrupted iterations
default   [  47% ] 177/200 VUs  2m34.0s/5m30.0s

running (2m35.0s), 172/200 VUs, 80547 complete and 0 interrupted iterations
default   [  47% ] 172/200 VUs  2m35.0s/5m30.0s

running (2m36.0s), 165/200 VUs, 81375 complete and 0 interrupted iterations
default   [  47% ] 165/200 VUs  2m36.0s/5m30.0s

running (2m37.0s), 159/200 VUs, 82189 complete and 0 interrupted iterations
default   [  48% ] 159/200 VUs  2m37.0s/5m30.0s

running (2m38.0s), 153/200 VUs, 82948 complete and 0 interrupted iterations
default   [  48% ] 153/200 VUs  2m38.0s/5m30.0s

running (2m39.0s), 147/200 VUs, 83701 complete and 0 interrupted iterations
default   [  48% ] 147/200 VUs  2m39.0s/5m30.0s

running (2m40.0s), 141/200 VUs, 84391 complete and 0 interrupted iterations
default   [  48% ] 141/200 VUs  2m40.0s/5m30.0s

running (2m41.0s), 136/200 VUs, 85018 complete and 0 interrupted iterations
default   [  49% ] 136/200 VUs  2m41.0s/5m30.0s

running (2m42.0s), 130/200 VUs, 85683 complete and 0 interrupted iterations
default   [  49% ] 130/200 VUs  2m42.0s/5m30.0s

running (2m43.0s), 123/200 VUs, 86316 complete and 0 interrupted iterations
default   [  49% ] 123/200 VUs  2m43.0s/5m30.0s

running (2m44.0s), 118/200 VUs, 86887 complete and 0 interrupted iterations
default   [  50% ] 118/200 VUs  2m44.0s/5m30.0s

running (2m45.0s), 112/200 VUs, 87404 complete and 0 interrupted iterations
default   [  50% ] 112/200 VUs  2m45.0s/5m30.0s

running (2m46.0s), 105/200 VUs, 87928 complete and 0 interrupted iterations
default   [  50% ] 105/200 VUs  2m46.0s/5m30.0s

running (2m47.0s), 099/200 VUs, 88438 complete and 0 interrupted iterations
default   [  51% ] 099/200 VUs  2m47.0s/5m30.0s

running (2m48.0s), 093/200 VUs, 88905 complete and 0 interrupted iterations
default   [  51% ] 093/200 VUs  2m48.0s/5m30.0s

running (2m49.0s), 088/200 VUs, 89359 complete and 0 interrupted iterations
default   [  51% ] 088/200 VUs  2m49.0s/5m30.0s

running (2m50.0s), 082/200 VUs, 89747 complete and 0 interrupted iterations
default   [  52% ] 082/200 VUs  2m50.0s/5m30.0s

running (2m51.0s), 075/200 VUs, 90115 complete and 0 interrupted iterations
default   [  52% ] 075/200 VUs  2m51.0s/5m30.0s

running (2m52.0s), 069/200 VUs, 90478 complete and 0 interrupted iterations
default   [  52% ] 069/200 VUs  2m52.0s/5m30.0s

running (2m53.0s), 064/200 VUs, 90774 complete and 0 interrupted iterations
default   [  52% ] 064/200 VUs  2m53.0s/5m30.0s

running (2m54.0s), 057/200 VUs, 91054 complete and 0 interrupted iterations
default   [  53% ] 057/200 VUs  2m54.0s/5m30.0s

running (2m55.0s), 051/200 VUs, 91328 complete and 0 interrupted iterations
default   [  53% ] 051/200 VUs  2m55.0s/5m30.0s

running (2m56.0s), 046/200 VUs, 91528 complete and 0 interrupted iterations
default   [  53% ] 046/200 VUs  2m56.0s/5m30.0s

running (2m57.0s), 039/200 VUs, 91743 complete and 0 interrupted iterations
default   [  54% ] 039/200 VUs  2m57.0s/5m30.0s

running (2m58.0s), 033/200 VUs, 91926 complete and 0 interrupted iterations
default   [  54% ] 033/200 VUs  2m58.0s/5m30.0s

running (2m59.0s), 028/200 VUs, 92050 complete and 0 interrupted iterations
default   [  54% ] 028/200 VUs  2m59.0s/5m30.0s

running (3m00.0s), 021/200 VUs, 92175 complete and 0 interrupted iterations
default   [  55% ] 021/200 VUs  3m00.0s/5m30.0s

running (3m01.0s), 020/200 VUs, 92256 complete and 0 interrupted iterations
default   [  55% ] 020/200 VUs  3m01.0s/5m30.0s

running (3m02.0s), 020/200 VUs, 92356 complete and 0 interrupted iterations
default   [  55% ] 020/200 VUs  3m02.0s/5m30.0s

running (3m03.0s), 020/200 VUs, 92436 complete and 0 interrupted iterations
default   [  55% ] 020/200 VUs  3m03.0s/5m30.0s

running (3m04.0s), 020/200 VUs, 92516 complete and 0 interrupted iterations
default   [  56% ] 020/200 VUs  3m04.0s/5m30.0s

running (3m05.0s), 020/200 VUs, 92616 complete and 0 interrupted iterations
default   [  56% ] 020/200 VUs  3m05.0s/5m30.0s

running (3m06.0s), 020/200 VUs, 92696 complete and 0 interrupted iterations
default   [  56% ] 020/200 VUs  3m06.0s/5m30.0s

running (3m07.0s), 020/200 VUs, 92796 complete and 0 interrupted iterations
default   [  57% ] 020/200 VUs  3m07.0s/5m30.0s

running (3m08.0s), 020/200 VUs, 92896 complete and 0 interrupted iterations
default   [  57% ] 020/200 VUs  3m08.0s/5m30.0s

running (3m09.0s), 020/200 VUs, 92976 complete and 0 interrupted iterations
default   [  57% ] 020/200 VUs  3m09.0s/5m30.0s

running (3m10.0s), 020/200 VUs, 93076 complete and 0 interrupted iterations
default   [  58% ] 020/200 VUs  3m10.0s/5m30.0s

running (3m11.0s), 020/200 VUs, 93156 complete and 0 interrupted iterations
default   [  58% ] 020/200 VUs  3m11.0s/5m30.0s

running (3m12.0s), 020/200 VUs, 93256 complete and 0 interrupted iterations
default   [  58% ] 020/200 VUs  3m12.0s/5m30.0s

running (3m13.0s), 020/200 VUs, 93336 complete and 0 interrupted iterations
default   [  58% ] 020/200 VUs  3m13.0s/5m30.0s

running (3m14.0s), 020/200 VUs, 93436 complete and 0 interrupted iterations
default   [  59% ] 020/200 VUs  3m14.0s/5m30.0s

running (3m15.0s), 020/200 VUs, 93536 complete and 0 interrupted iterations
default   [  59% ] 020/200 VUs  3m15.0s/5m30.0s

running (3m16.0s), 020/200 VUs, 93616 complete and 0 interrupted iterations
default   [  59% ] 020/200 VUs  3m16.0s/5m30.0s

running (3m17.0s), 020/200 VUs, 93716 complete and 0 interrupted iterations
default   [  60% ] 020/200 VUs  3m17.0s/5m30.0s

running (3m18.0s), 020/200 VUs, 93796 complete and 0 interrupted iterations
default   [  60% ] 020/200 VUs  3m18.0s/5m30.0s

running (3m19.0s), 020/200 VUs, 93896 complete and 0 interrupted iterations
default   [  60% ] 020/200 VUs  3m19.0s/5m30.0s

running (3m20.0s), 020/200 VUs, 93996 complete and 0 interrupted iterations
default   [  61% ] 020/200 VUs  3m20.0s/5m30.0s

running (3m21.0s), 020/200 VUs, 94077 complete and 0 interrupted iterations
default   [  61% ] 020/200 VUs  3m21.0s/5m30.0s

running (3m22.0s), 020/200 VUs, 94176 complete and 0 interrupted iterations
default   [  61% ] 020/200 VUs  3m22.0s/5m30.0s

running (3m23.0s), 020/200 VUs, 94257 complete and 0 interrupted iterations
default   [  62% ] 020/200 VUs  3m23.0s/5m30.0s

running (3m24.0s), 020/200 VUs, 94357 complete and 0 interrupted iterations
default   [  62% ] 020/200 VUs  3m24.0s/5m30.0s

running (3m25.0s), 020/200 VUs, 94439 complete and 0 interrupted iterations
default   [  62% ] 020/200 VUs  3m25.0s/5m30.0s

running (3m26.0s), 020/200 VUs, 94539 complete and 0 interrupted iterations
default   [  62% ] 020/200 VUs  3m26.0s/5m30.0s

running (3m27.0s), 020/200 VUs, 94639 complete and 0 interrupted iterations
default   [  63% ] 020/200 VUs  3m27.0s/5m30.0s

running (3m28.0s), 020/200 VUs, 94719 complete and 0 interrupted iterations
default   [  63% ] 020/200 VUs  3m28.0s/5m30.0s

running (3m29.0s), 020/200 VUs, 94799 complete and 0 interrupted iterations
default   [  63% ] 020/200 VUs  3m29.0s/5m30.0s

running (3m30.0s), 020/200 VUs, 94899 complete and 0 interrupted iterations
default   [  64% ] 020/200 VUs  3m30.0s/5m30.0s

running (3m31.0s), 020/200 VUs, 94979 complete and 0 interrupted iterations
default   [  64% ] 020/200 VUs  3m31.0s/5m30.0s

running (3m32.0s), 020/200 VUs, 95079 complete and 0 interrupted iterations
default   [  64% ] 020/200 VUs  3m32.0s/5m30.0s

running (3m33.0s), 020/200 VUs, 95159 complete and 0 interrupted iterations
default   [  65% ] 020/200 VUs  3m33.0s/5m30.0s

running (3m34.0s), 020/200 VUs, 95259 complete and 0 interrupted iterations
default   [  65% ] 020/200 VUs  3m34.0s/5m30.0s

running (3m35.0s), 020/200 VUs, 95359 complete and 0 interrupted iterations
default   [  65% ] 020/200 VUs  3m35.0s/5m30.0s

running (3m36.0s), 020/200 VUs, 95439 complete and 0 interrupted iterations
default   [  65% ] 020/200 VUs  3m36.0s/5m30.0s

running (3m37.0s), 020/200 VUs, 95539 complete and 0 interrupted iterations
default   [  66% ] 020/200 VUs  3m37.0s/5m30.0s

running (3m38.0s), 020/200 VUs, 95619 complete and 0 interrupted iterations
default   [  66% ] 020/200 VUs  3m38.0s/5m30.0s

running (3m39.0s), 020/200 VUs, 95719 complete and 0 interrupted iterations
default   [  66% ] 020/200 VUs  3m39.0s/5m30.0s

running (3m40.0s), 020/200 VUs, 95799 complete and 0 interrupted iterations
default   [  67% ] 020/200 VUs  3m40.0s/5m30.0s

running (3m41.0s), 020/200 VUs, 95899 complete and 0 interrupted iterations
default   [  67% ] 020/200 VUs  3m41.0s/5m30.0s

running (3m42.0s), 020/200 VUs, 95980 complete and 0 interrupted iterations
default   [  67% ] 020/200 VUs  3m42.0s/5m30.0s

running (3m43.0s), 020/200 VUs, 96079 complete and 0 interrupted iterations
default   [  68% ] 020/200 VUs  3m43.0s/5m30.0s

running (3m44.0s), 020/200 VUs, 96179 complete and 0 interrupted iterations
default   [  68% ] 020/200 VUs  3m44.0s/5m30.0s

running (3m45.0s), 020/200 VUs, 96260 complete and 0 interrupted iterations
default   [  68% ] 020/200 VUs  3m45.0s/5m30.0s

running (3m46.0s), 020/200 VUs, 96360 complete and 0 interrupted iterations
default   [  68% ] 020/200 VUs  3m46.0s/5m30.0s

running (3m47.0s), 020/200 VUs, 96460 complete and 0 interrupted iterations
default   [  69% ] 020/200 VUs  3m47.0s/5m30.0s

running (3m48.0s), 020/200 VUs, 96540 complete and 0 interrupted iterations
default   [  69% ] 020/200 VUs  3m48.0s/5m30.0s

running (3m49.0s), 020/200 VUs, 96640 complete and 0 interrupted iterations
default   [  69% ] 020/200 VUs  3m49.0s/5m30.0s

running (3m50.0s), 020/200 VUs, 96724 complete and 0 interrupted iterations
default   [  70% ] 020/200 VUs  3m50.0s/5m30.0s

running (3m51.0s), 020/200 VUs, 96824 complete and 0 interrupted iterations
default   [  70% ] 020/200 VUs  3m51.0s/5m30.0s

running (3m52.0s), 020/200 VUs, 96924 complete and 0 interrupted iterations
default   [  70% ] 020/200 VUs  3m52.0s/5m30.0s

running (3m53.0s), 020/200 VUs, 97004 complete and 0 interrupted iterations
default   [  71% ] 020/200 VUs  3m53.0s/5m30.0s

running (3m54.0s), 020/200 VUs, 97104 complete and 0 interrupted iterations
default   [  71% ] 020/200 VUs  3m54.0s/5m30.0s

running (3m55.0s), 020/200 VUs, 97184 complete and 0 interrupted iterations
default   [  71% ] 020/200 VUs  3m55.0s/5m30.0s

running (3m56.0s), 020/200 VUs, 97284 complete and 0 interrupted iterations
default   [  72% ] 020/200 VUs  3m56.0s/5m30.0s

running (3m57.0s), 020/200 VUs, 97364 complete and 0 interrupted iterations
default   [  72% ] 020/200 VUs  3m57.0s/5m30.0s

running (3m58.0s), 020/200 VUs, 97464 complete and 0 interrupted iterations
default   [  72% ] 020/200 VUs  3m58.0s/5m30.0s

running (3m59.0s), 020/200 VUs, 97544 complete and 0 interrupted iterations
default   [  72% ] 020/200 VUs  3m59.0s/5m30.0s

running (4m00.0s), 020/200 VUs, 97644 complete and 0 interrupted iterations
default   [  73% ] 020/200 VUs  4m00.0s/5m30.0s

running (4m01.0s), 020/200 VUs, 97744 complete and 0 interrupted iterations
default   [  73% ] 020/200 VUs  4m01.0s/5m30.0s

running (4m02.0s), 020/200 VUs, 97824 complete and 0 interrupted iterations
default   [  73% ] 020/200 VUs  4m02.0s/5m30.0s

running (4m03.0s), 020/200 VUs, 97924 complete and 0 interrupted iterations
default   [  74% ] 020/200 VUs  4m03.0s/5m30.0s

running (4m04.0s), 020/200 VUs, 98006 complete and 0 interrupted iterations
default   [  74% ] 020/200 VUs  4m04.0s/5m30.0s

running (4m05.0s), 020/200 VUs, 98086 complete and 0 interrupted iterations
default   [  74% ] 020/200 VUs  4m05.0s/5m30.0s

running (4m06.0s), 020/200 VUs, 98186 complete and 0 interrupted iterations
default   [  75% ] 020/200 VUs  4m06.0s/5m30.0s

running (4m07.0s), 020/200 VUs, 98286 complete and 0 interrupted iterations
default   [  75% ] 020/200 VUs  4m07.0s/5m30.0s

running (4m08.0s), 020/200 VUs, 98366 complete and 0 interrupted iterations
default   [  75% ] 020/200 VUs  4m08.0s/5m30.0s

running (4m09.0s), 020/200 VUs, 98466 complete and 0 interrupted iterations
default   [  75% ] 020/200 VUs  4m09.0s/5m30.0s

running (4m10.0s), 020/200 VUs, 98546 complete and 0 interrupted iterations
default   [  76% ] 020/200 VUs  4m10.0s/5m30.0s

running (4m11.0s), 020/200 VUs, 98646 complete and 0 interrupted iterations
default   [  76% ] 020/200 VUs  4m11.0s/5m30.0s

running (4m12.0s), 020/200 VUs, 98726 complete and 0 interrupted iterations
default   [  76% ] 020/200 VUs  4m12.0s/5m30.0s

running (4m13.0s), 020/200 VUs, 98826 complete and 0 interrupted iterations
default   [  77% ] 020/200 VUs  4m13.0s/5m30.0s

running (4m14.0s), 020/200 VUs, 98926 complete and 0 interrupted iterations
default   [  77% ] 020/200 VUs  4m14.0s/5m30.0s

running (4m15.0s), 020/200 VUs, 99006 complete and 0 interrupted iterations
default   [  77% ] 020/200 VUs  4m15.0s/5m30.0s

running (4m16.0s), 020/200 VUs, 99106 complete and 0 interrupted iterations
default   [  78% ] 020/200 VUs  4m16.0s/5m30.0s

running (4m17.0s), 020/200 VUs, 99186 complete and 0 interrupted iterations
default   [  78% ] 020/200 VUs  4m17.0s/5m30.0s

running (4m18.0s), 020/200 VUs, 99286 complete and 0 interrupted iterations
default   [  78% ] 020/200 VUs  4m18.0s/5m30.0s

running (4m19.0s), 020/200 VUs, 99366 complete and 0 interrupted iterations
default   [  78% ] 020/200 VUs  4m19.0s/5m30.0s

running (4m20.0s), 020/200 VUs, 99466 complete and 0 interrupted iterations
default   [  79% ] 020/200 VUs  4m20.0s/5m30.0s

running (4m21.0s), 020/200 VUs, 99566 complete and 0 interrupted iterations
default   [  79% ] 020/200 VUs  4m21.0s/5m30.0s

running (4m22.0s), 020/200 VUs, 99646 complete and 0 interrupted iterations
default   [  79% ] 020/200 VUs  4m22.0s/5m30.0s

running (4m23.0s), 020/200 VUs, 99746 complete and 0 interrupted iterations
default   [  80% ] 020/200 VUs  4m23.0s/5m30.0s

running (4m24.0s), 020/200 VUs, 99826 complete and 0 interrupted iterations
default   [  80% ] 020/200 VUs  4m24.0s/5m30.0s

running (4m25.0s), 020/200 VUs, 99926 complete and 0 interrupted iterations
default   [  80% ] 020/200 VUs  4m25.0s/5m30.0s

running (4m26.0s), 020/200 VUs, 100006 complete and 0 interrupted iterations
default   [  81% ] 020/200 VUs  4m26.0s/5m30.0s

running (4m27.0s), 020/200 VUs, 100106 complete and 0 interrupted iterations
default   [  81% ] 020/200 VUs  4m27.0s/5m30.0s

running (4m28.0s), 020/200 VUs, 100186 complete and 0 interrupted iterations
default   [  81% ] 020/200 VUs  4m28.0s/5m30.0s

running (4m29.0s), 020/200 VUs, 100286 complete and 0 interrupted iterations
default   [  82% ] 020/200 VUs  4m29.0s/5m30.0s

running (4m30.0s), 020/200 VUs, 100375 complete and 0 interrupted iterations
default   [  82% ] 020/200 VUs  4m30.0s/5m30.0s

running (4m31.0s), 020/200 VUs, 100466 complete and 0 interrupted iterations
default   [  82% ] 020/200 VUs  4m31.0s/5m30.0s

running (4m32.0s), 020/200 VUs, 100552 complete and 0 interrupted iterations
default   [  82% ] 020/200 VUs  4m32.0s/5m30.0s

running (4m33.0s), 020/200 VUs, 100646 complete and 0 interrupted iterations
default   [  83% ] 020/200 VUs  4m33.0s/5m30.0s

running (4m34.0s), 020/200 VUs, 100746 complete and 0 interrupted iterations
default   [  83% ] 020/200 VUs  4m34.0s/5m30.0s

running (4m35.0s), 020/200 VUs, 100826 complete and 0 interrupted iterations
default   [  83% ] 020/200 VUs  4m35.0s/5m30.0s

running (4m36.0s), 020/200 VUs, 100926 complete and 0 interrupted iterations
default   [  84% ] 020/200 VUs  4m36.0s/5m30.0s

running (4m37.0s), 020/200 VUs, 101012 complete and 0 interrupted iterations
default   [  84% ] 020/200 VUs  4m37.0s/5m30.0s

running (4m38.0s), 020/200 VUs, 101106 complete and 0 interrupted iterations
default   [  84% ] 020/200 VUs  4m38.0s/5m30.0s

running (4m39.0s), 020/200 VUs, 101206 complete and 0 interrupted iterations
default   [  85% ] 020/200 VUs  4m39.0s/5m30.0s

running (4m40.0s), 020/200 VUs, 101292 complete and 0 interrupted iterations
default   [  85% ] 020/200 VUs  4m40.0s/5m30.0s

running (4m41.0s), 020/200 VUs, 101386 complete and 0 interrupted iterations
default   [  85% ] 020/200 VUs  4m41.0s/5m30.0s

running (4m42.0s), 020/200 VUs, 101472 complete and 0 interrupted iterations
default   [  85% ] 020/200 VUs  4m42.0s/5m30.0s

running (4m43.0s), 020/200 VUs, 101572 complete and 0 interrupted iterations
default   [  86% ] 020/200 VUs  4m43.0s/5m30.0s

running (4m44.0s), 020/200 VUs, 101672 complete and 0 interrupted iterations
default   [  86% ] 020/200 VUs  4m44.0s/5m30.0s

running (4m45.0s), 020/200 VUs, 101752 complete and 0 interrupted iterations
default   [  86% ] 020/200 VUs  4m45.0s/5m30.0s

running (4m46.0s), 020/200 VUs, 101852 complete and 0 interrupted iterations
default   [  87% ] 020/200 VUs  4m46.0s/5m30.0s

running (4m47.0s), 020/200 VUs, 101932 complete and 0 interrupted iterations
default   [  87% ] 020/200 VUs  4m47.0s/5m30.0s

running (4m48.0s), 020/200 VUs, 102032 complete and 0 interrupted iterations
default   [  87% ] 020/200 VUs  4m48.0s/5m30.0s

running (4m49.0s), 020/200 VUs, 102132 complete and 0 interrupted iterations
default   [  88% ] 020/200 VUs  4m49.0s/5m30.0s

running (4m50.0s), 020/200 VUs, 102212 complete and 0 interrupted iterations
default   [  88% ] 020/200 VUs  4m50.0s/5m30.0s

running (4m51.0s), 020/200 VUs, 102312 complete and 0 interrupted iterations
default   [  88% ] 020/200 VUs  4m51.0s/5m30.0s

running (4m52.0s), 020/200 VUs, 102392 complete and 0 interrupted iterations
default   [  88% ] 020/200 VUs  4m52.0s/5m30.0s

running (4m53.0s), 020/200 VUs, 102492 complete and 0 interrupted iterations
default   [  89% ] 020/200 VUs  4m53.0s/5m30.0s

running (4m54.0s), 020/200 VUs, 102592 complete and 0 interrupted iterations
default   [  89% ] 020/200 VUs  4m54.0s/5m30.0s

running (4m55.0s), 020/200 VUs, 102672 complete and 0 interrupted iterations
default   [  89% ] 020/200 VUs  4m55.0s/5m30.0s

running (4m56.0s), 020/200 VUs, 102772 complete and 0 interrupted iterations
default   [  90% ] 020/200 VUs  4m56.0s/5m30.0s

running (4m57.0s), 020/200 VUs, 102852 complete and 0 interrupted iterations
default   [  90% ] 020/200 VUs  4m57.0s/5m30.0s

running (4m58.0s), 020/200 VUs, 102952 complete and 0 interrupted iterations
default   [  90% ] 020/200 VUs  4m58.0s/5m30.0s

running (4m59.0s), 020/200 VUs, 103032 complete and 0 interrupted iterations
default   [  91% ] 020/200 VUs  4m59.0s/5m30.0s

running (5m00.0s), 020/200 VUs, 103132 complete and 0 interrupted iterations
default   [  91% ] 020/200 VUs  5m00.0s/5m30.0s

running (5m01.0s), 020/200 VUs, 103232 complete and 0 interrupted iterations
default   [  91% ] 020/200 VUs  5m01.0s/5m30.0s

running (5m02.0s), 019/200 VUs, 103311 complete and 0 interrupted iterations
default   [  92% ] 019/200 VUs  5m02.0s/5m30.0s

running (5m03.0s), 019/200 VUs, 103406 complete and 0 interrupted iterations
default   [  92% ] 019/200 VUs  5m03.0s/5m30.0s

running (5m04.0s), 018/200 VUs, 103479 complete and 0 interrupted iterations
default   [  92% ] 018/200 VUs  5m04.0s/5m30.0s

running (5m05.0s), 017/200 VUs, 103568 complete and 0 interrupted iterations
default   [  92% ] 017/200 VUs  5m05.0s/5m30.0s

running (5m06.0s), 017/200 VUs, 103636 complete and 0 interrupted iterations
default   [  93% ] 017/200 VUs  5m06.0s/5m30.0s

running (5m07.0s), 016/200 VUs, 103717 complete and 0 interrupted iterations
default   [  93% ] 016/200 VUs  5m07.0s/5m30.0s

running (5m08.0s), 015/200 VUs, 103795 complete and 0 interrupted iterations
default   [  93% ] 015/200 VUs  5m08.0s/5m30.0s

running (5m09.0s), 015/200 VUs, 103855 complete and 0 interrupted iterations
default   [  94% ] 015/200 VUs  5m09.0s/5m30.0s

running (5m10.0s), 014/200 VUs, 103926 complete and 0 interrupted iterations
default   [  94% ] 014/200 VUs  5m10.0s/5m30.0s

running (5m11.0s), 013/200 VUs, 103981 complete and 0 interrupted iterations
default   [  94% ] 013/200 VUs  5m11.0s/5m30.0s

running (5m12.0s), 013/200 VUs, 104046 complete and 0 interrupted iterations
default   [  95% ] 013/200 VUs  5m12.0s/5m30.0s

running (5m13.0s), 012/200 VUs, 104107 complete and 0 interrupted iterations
default   [  95% ] 012/200 VUs  5m13.0s/5m30.0s

running (5m14.0s), 011/200 VUs, 104154 complete and 0 interrupted iterations
default   [  95% ] 011/200 VUs  5m14.0s/5m30.0s

running (5m15.0s), 011/200 VUs, 104209 complete and 0 interrupted iterations
default   [  95% ] 011/200 VUs  5m15.0s/5m30.0s

running (5m16.0s), 010/200 VUs, 104260 complete and 0 interrupted iterations
default   [  96% ] 010/200 VUs  5m16.0s/5m30.0s

running (5m17.0s), 009/200 VUs, 104299 complete and 0 interrupted iterations
default   [  96% ] 009/200 VUs  5m17.0s/5m30.0s

running (5m18.0s), 009/200 VUs, 104344 complete and 0 interrupted iterations
default   [  96% ] 009/200 VUs  5m18.0s/5m30.0s

running (5m19.0s), 008/200 VUs, 104385 complete and 0 interrupted iterations
default   [  97% ] 008/200 VUs  5m19.0s/5m30.0s

running (5m20.0s), 007/200 VUs, 104416 complete and 0 interrupted iterations
default   [  97% ] 007/200 VUs  5m20.0s/5m30.0s

running (5m21.0s), 007/200 VUs, 104451 complete and 0 interrupted iterations
default   [  97% ] 007/200 VUs  5m21.0s/5m30.0s

running (5m22.0s), 006/200 VUs, 104482 complete and 0 interrupted iterations
default   [  98% ] 006/200 VUs  5m22.0s/5m30.0s

running (5m23.0s), 005/200 VUs, 104505 complete and 0 interrupted iterations
default   [  98% ] 005/200 VUs  5m23.0s/5m30.0s

running (5m24.0s), 005/200 VUs, 104530 complete and 0 interrupted iterations
default   [  98% ] 005/200 VUs  5m24.0s/5m30.0s

running (5m25.0s), 004/200 VUs, 104551 complete and 0 interrupted iterations
default   [  98% ] 004/200 VUs  5m25.0s/5m30.0s

running (5m26.0s), 003/200 VUs, 104569 complete and 0 interrupted iterations
default   [  99% ] 003/200 VUs  5m26.0s/5m30.0s

running (5m27.0s), 003/200 VUs, 104581 complete and 0 interrupted iterations
default   [  99% ] 003/200 VUs  5m27.0s/5m30.0s

running (5m28.0s), 002/200 VUs, 104592 complete and 0 interrupted iterations
default   [  99% ] 002/200 VUs  5m28.0s/5m30.0s

running (5m29.0s), 001/200 VUs, 104601 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  5m29.0s/5m30.0s

running (5m30.0s), 001/200 VUs, 104605 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  5m30.0s/5m30.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.20' rate=0.00%

    java_request_duration
    ✓ 'p(95)<3000' p(95)=4.67ms

    swift_request_duration
    ✓ 'p(95)<3000' p(95)=7.41ms


  █ TOTAL RESULTS 

    checks_total.......: 836856  2534.37252/s
    checks_succeeded...: 100.00% 836856 out of 836856
    checks_failed......: 0.00%   0 out of 836856

    ✓ Swift spike /products: status 2xx
    ✓ Swift spike /products: response time < 2s
    ✓ Swift spike /products: has body
    ✓ Java spike /products: status 2xx
    ✓ Java spike /products: response time < 2s
    ✓ Java spike /products: has body
    ✓ Swift health UP
    ✓ Java health UP

    CUSTOM
    java_error_rate................: 0.00%  0 out of 104607
    java_request_duration..........: avg=1.81ms   min=221µs    med=1.07ms   max=161.85ms p(90)=3.38ms  p(95)=4.67ms  
    java_requests_total............: 104607 316.796565/s
    swift_error_rate...............: 0.00%  0 out of 104607
    swift_request_duration.........: avg=2.8ms    min=440µs    med=1.83ms   max=77.48ms  p(90)=5.74ms  p(95)=7.41ms  
    swift_requests_total...........: 104607 316.796565/s

    HTTP
    http_req_duration..............: avg=2.3ms    min=199µs    med=1.33ms   max=161.85ms p(90)=4.84ms  p(95)=6.94ms  
      { expected_response:true }...: avg=2.3ms    min=199µs    med=1.33ms   max=161.85ms p(90)=4.84ms  p(95)=6.94ms  
    http_req_failed................: 0.00%  0 out of 418428
    http_reqs......................: 418428 1267.18626/s

    EXECUTION
    iteration_duration.............: avg=209.68ms min=201.58ms med=206.41ms max=370.48ms p(90)=219.9ms p(95)=224.42ms
    iterations.....................: 104607 316.796565/s
    vus............................: 1      min=1           max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 320 MB 968 kB/s
    data_sent......................: 33 MB  100 kB/s



running (5m30.2s), 000/200 VUs, 104607 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  5m30s